from multiprocessing import Process,Pool
import time
import os
# Програма підраховує середний час виконання завданної кількості операцій вирахування квадратного кореню числа
# n - кількість проходів функции за які вираховується середній час виконання j ітерацій
#

def f(x):
     return x**0.5

def iter(n):

    for j in range(0,1000001,100000):
        mid = 0
        for k in range(n):
            start = time.time()
            for i in range(j):
                x=f(i)
            mid=mid+(time.time()-start)
        print("Кількість ітерацій - ", j, "   Середній час виконання ",n, " проходів становить -" ,mid/n)

# Питання до викладача!
#  Чому програма коректно працює тільки коли використовується лише один із процесів?
# Зрозуміло, що методи Pool і Process можуть конфлікувати і їх не бажано запускати разом,
# але програма починає виконуватися некоректно, якщо я запускаю спочатку функцію iter(10), а потім один з процесів.
# Чому ні Pool ні Process не показали покращення часу обробки?
#
# Заздалегідь вдячний за відповідь.


print("Без застосування мультіпроцессінгу ")
iter(10)

# if __name__ == '__main__':
#     print("Застосування методa Process")
#     p = Process(target=iter, args=(10,))
#     p.start()
#     p.join()

# if __name__ == '__main__':
#     print("Застосування методa Pool")
#     cpu = os.cpu_count()
#     print(f"Your PC has {cpu} cores.")
#     with Pool(cpu) as p:
#         p=iter(10)

