import hashlib

dc=dict()
alphabet=['А','Б','В','Г','Ґ','Д','Е','Є','Ж','З','И','І','Ї','Й','К','Л','М','Н','О','П','Р','С','Т','У','Ф','Х','Ц','Ч','Ш','Щ','Ю','Я']
tovar=[['Tv1',125.23],['Tv2',130.35],['comp1',4521.21],['comp2',2560.01],['mouse',15.23],['Tv1',125.23],['Tv2',130.35],
       ['comp1',4521.21],['comp2',2560.01],['mouse',15.23],['Tv1',125.23],['Tv2',130.35],['comp1',4521.21],['comp2',2560.01],
       ['mouse',15.23],['Tv1',125.23],['Tv23',130.35],['comp1',4521.21],['comp21',2560.01],['mouse',15.23],
       ['Tv1',125.23],['Tv2',130.35],['comp1',4521.21],['comp2',2560.01],['mouse',15.23],['Tv1',125.23],['Tv2',130.35],
       ['Tv1',125.23],['Tv2',130.35],['comp1',4521.21],['comp2',2560.01],['mouse',15.23]]

for i in range(32):
    item=hashlib.md5(bytes(tovar[i][0] + str(tovar[i][1]), 'UTF-8'))
    if not (item.hexdigest() in dc.values()):
        dc[alphabet[i]] = item.hexdigest()

print(dc)
