# Згенерувати рандомне число
import random
num=random.randint(1,100)
# Ввести логічну змінну яка буде показувати виграли чи програли гру при програші вона True
b=True
#
# Створити цикл for який максимально виконаэться 6 разів (6 спроб) за допомогою range

for i in range(1,7):
# Цикл на кожному кроці вводить число та перевіряє його
    # n присвоїти int від введеного числа
    n = int(input("Введіть число  "))
    # перевіряємо чи вгадали число n==num
    if n==num:
        # якщо вгадали друкуємо привітання, число, кількість спроб
        print("Вітаю ви вгадали число ",num,"  Кількість спроб",i)
        # змінюємо значння b=False
        b=False
        # передчасно виходимо з циклу
        break
    ## перевіряємо якщо число n>num
    elif n>num:
        # друкуємо що задумане число менше
        print("Мое число менше ")
    ## перевіряємо якщо число n<num
    elif n<num:
        # друкуємо що задумане число більше
        print("Моє число більше")
# повертаємося до початку циклу
# після виходу з цикла перевіряємо чи було знайдено правильне число
# якщо b = True друкуємо "Ви програли" інакше виходимо з програми
if b:
    print("Вибачте ви програли")



